libxmlbus/data/wsaddr-testset/documents/echo/soap11/duplicateActionRequest.xml

<?xml version="1.0"?>
<!-- $Id: duplicateActionRequest.xml,v 1.6 2006/02/20 16:01:17 pdowney Exp $ -->
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap11:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:D447F2F4-9980-4012-93A4-5F0C9F7630ED</wsa:MessageID>
  </soap11:Header>
  <soap11:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap11:Body>
</soap11:Envelope>
